Sample/Load Testing
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking iovio.com (be patient).....done


Server Software:        Apache/2.4.29
Server Hostname:        iovio.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-CHACHA20-POLY1305,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        iovio.com

Document Path:          /
Document Length:        660921 bytes

Concurrency Level:      3
Time taken for tests:   33.216 seconds
Complete requests:      50
Failed requests:        0
Total transferred:      33081600 bytes
HTML transferred:       33046050 bytes
Requests per second:    1.51 [#/sec] (mean)
Time per request:       1992.973 [ms] (mean)
Time per request:       664.324 [ms] (mean, across all concurrent requests)
Transfer rate:          972.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       57   76  34.5     67     287
Processing:   963 1858 263.3   1933    2308
Waiting:      657 1513 240.0   1573    1819
Total:       1156 1934 247.7   2001    2373

Percentage of the requests served within a certain time (ms)
  50%   2001
  66%   2029
  75%   2113
  80%   2153
  90%   2203
  95%   2213
  98%   2373
  99%   2373
 100%   2373 (longest request)